SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0020/MM32L0020_Bootloader/Device/MM32L0020/Include/reg_gpio.h
#define GPIO_CRL_CNF_MODE_0_Pos          (0)                            ///*!< Analog input */
#define GPIO_CRL_CNF_MODE_1_Pos          (4)                            ///*!< Floating input */
#define GPIO_CRL_CNF_MODE_2_Pos          (8)                            ///*!< Pull up and down input */
#define GPIO_CRL_CNF_MODE_3_Pos          (12)                           ///*!< Reseved input mode */
#define GPIO_CRL_CNF_MODE_4_Pos          (16)                           ///*!< Universal push-pull  output default */
#define GPIO_CRL_CNF_MODE_5_Pos          (20)                           ///*!< Universal open drain output default */
#define GPIO_CRL_CNF_MODE_6_Pos          (24)                           ///*!< Multiplex push-pull  output default */
#define GPIO_CRL_CNF_MODE_7_Pos          (28)                           ///*!< Multiplex open drain output default */
#define GPIO_CRH_CNF_MODE_8_Pos          (0)                            ///*!< Universal push-pull  output 50MHZ */
#define GPIO_CRH_CNF_MODE_9_Pos          (4)                            ///*!< Universal open drain output 50MHZ */
#define GPIO_CRH_CNF_MODE_10_Pos         (8)                            ///*!< Multiplex push-pull  output 50MHZ */
#define GPIO_CRH_CNF_MODE_11_Pos         (12)                           ///*!< Multiplex open drain output 50MHZ */
#define GPIO_CRH_CNF_MODE_12_Pos         (16)                           ///*!< Universal push-pull  output 20MHZ */
#define GPIO_CRH_CNF_MODE_13_Pos         (20)                           ///*!< Universal open drain output 20MHZ */
#define GPIO_CRH_CNF_MODE_14_Pos         (24)                           ///*!< Multiplex push-pull  output 20MHZ */
#define GPIO_CRH_CNF_MODE_15_Pos         (28)                           ///*!< Multiplex open drain output 20MHZ */

/**
  * @brief GPIO_CRL Register Bit Definition
  */
#define GPIO_CRL_MODE                    ((uint32_t)0x33333333)         /*!< Port x mode bits */

#define GPIO_CRL_MODE0_Pos               (0)
#define GPIO_CRL_MODE0                   (0x03U << GPIO_CRL_MODE0_Pos)  /*!< MODE0[1:0] bits (portx mode bits, pin 0) */
#define GPIO_CRL_MODE0_0                 (0x01U << GPIO_CRL_MODE0_Pos)  /*!< Bit 0 */
#define GPIO_CRL_MODE0_1                 (0x02U << GPIO_CRL_MODE0_Pos)  /*!< Bit 1 */

#define GPIO_CRL_CNF0_Pos                (2)
#define GPIO_CRL_CNF0                    (0x03U << GPIO_CRL_CNF0_Pos)   /*!< CNF0[1:0] bits (portx configuration bits, pin 0) */
#define GPIO_CRL_CNF0_0                  (0x01U << GPIO_CRL_CNF0_Pos)   /*!< Bit 0 */
#define GPIO_CRL_CNF0_1                  (0x02U << GPIO_CRL_CNF0_Pos)   /*!< Bit 1 */

#define GPIO_CRL_MODE1_Pos               (4)
#define GPIO_CRL_MODE1                   (0x03U << GPIO_CRL_MODE1_Pos)  /*!< MODE1[1:0] bits (portx mode bits, pin 1) */
#define GPIO_CRL_MODE1_0                 (0x01U << GPIO_CRL_MODE1_Pos)  /*!< Bit 0 */
#define GPIO_CRL_MODE1_1                 (0x02U << GPIO_CRL_MODE1_Pos)  /*!< Bit 1 */

#define GPIO_CRL_CNF1_Pos                (6)
#define GPIO_CRL_CNF1                    (0x03U << GPIO_CRL_CNF1_Pos)   /*!< CNF1[1:0] bits (portx configuration bits, pin 1) */
#define GPIO_CRL_CNF1_0                  (0x01U << GPIO_CRL_CNF1_Pos)   /*!< Bit 0 */
#define GPIO_CRL_CNF1_1                  (0x02U << GPIO_CRL_CNF1_Pos)   /*!< Bit 1 */

#define GPIO_CRL_MODE2_Pos               (8)
#define GPIO_CRL_MODE2                   (0x03U << GPIO_CRL_MODE2_Pos)  /*!< MODE2[1:0] bits (portx mode bits, pin 2) */
#define GPIO_CRL_MODE2_0                 (0x01U << GPIO_CRL_MODE2_Pos)  /*!< Bit 0 */
#define GPIO_CRL_MODE2_1                 (0x02U << GPIO_CRL_MODE2_Pos)  /*!< Bit 1 */

#define GPIO_CRL_CNF2_Pos                (10)
#define GPIO_CRL_CNF2                    (0x03U << GPIO_CRL_CNF2_Pos)   /*!< CNF2[1:0] bits (portx configuration bits, pin 2) */
#define GPIO_CRL_CNF2_0                  (0x01U << GPIO_CRL_CNF2_Pos)   /*!< Bit 0 */
#define GPIO_CRL_CNF2_1                  (0x02U << GPIO_CRL_CNF2_Pos)   /*!< Bit 1 */

#define GPIO_CRL_MODE3_Pos               (12)
#define GPIO_CRL_MODE3                   (0x03U << GPIO_CRL_MODE3_Pos)  /*!< MODE3[1:0] bits (portx mode bits, pin 3) */
#define GPIO_CRL_MODE3_0                 (0x01U << GPIO_CRL_MODE3_Pos)  /*!< Bit 0 */
#define GPIO_CRL_MODE3_1                 (0x02U << GPIO_CRL_MODE3_Pos)  /*!< Bit 1 */

#define GPIO_CRL_CNF3_Pos                (14)
#define GPIO_CRL_CNF3                    (0x03U << GPIO_CRL_CNF3_Pos)   /*!< CNF3[1:0] bits (portx configuration bits, pin 3) */
#define GPIO_CRL_CNF3_0                  (0x01U << GPIO_CRL_CNF3_Pos)   /*!< Bit 0 */
#define GPIO_CRL_CNF3_1                  (0x02U << GPIO_CRL_CNF3_Pos)   /*!< Bit 1 */

#define GPIO_CRL_MODE4_Pos               (16)
#define GPIO_CRL_MODE4                   (0x03U << GPIO_CRL_MODE4_Pos)  /*!< MODE4[1:0] bits (portx mode bits, pin 4) */
#define GPIO_CRL_MODE4_0                 (0x01U << GPIO_CRL_MODE4_Pos)  /*!< Bit 0 */
#define GPIO_CRL_MODE4_1                 (0x02U << GPIO_CRL_MODE4_Pos)  /*!< Bit 1 */

#define GPIO_CRL_CNF4_Pos                (18)
#define GPIO_CRL_CNF4                    (0x03U << GPIO_CRL_CNF4_Pos)   /*!< CNF4[1:0] bits (portx configuration bits, pin 4) */
#define GPIO_CRL_CNF4_0                  (0x01U << GPIO_CRL_CNF4_Pos)   /*!< Bit 0 */
#define GPIO_CRL_CNF4_1                  (0x02U << GPIO_CRL_CNF4_Pos)   /*!< Bit 1 */

#define GPIO_CRL_MODE5_Pos               (20)
#define GPIO_CRL_MODE5                   (0x03U << GPIO_CRL_MODE5_Pos)  /*!< MODE5[1:0] bits (portx mode bits, pin 5) */
#define GPIO_CRL_MODE5_0                 (0x01U << GPIO_CRL_MODE5_Pos)  /*!< Bit 0 */
#define GPIO_CRL_MODE5_1                 (0x02U << GPIO_CRL_MODE5_Pos)  /*!< Bit 1 */

#define GPIO_CRL_CNF5_Pos                (22)
#define GPIO_CRL_CNF5                    (0x03U << GPIO_CRL_CNF5_Pos)   /*!< CNF5[1:0] bits (portx configuration bits, pin 5) */
#define GPIO_CRL_CNF5_0                  (0x01U << GPIO_CRL_CNF5_Pos)   /*!< Bit 0 */
#define GPIO_CRL_CNF5_1                  (0x02U << GPIO_CRL_CNF5_Pos)   /*!< Bit 1 */

#define GPIO_CRL_MODE6_Pos               (24)
#define GPIO_CRL_MODE6                   (0x03U << GPIO_CRL_MODE6_Pos)  /*!< MODE6[1:0] bits (portx mode bits, pin 6) */
#define GPIO_CRL_MODE6_0                 (0x01U << GPIO_CRL_MODE6_Pos)  /*!< Bit 0 */
#define GPIO_CRL_MODE6_1                 (0x02U << GPIO_CRL_MODE6_Pos)  /*!< Bit 1 */

#define GPIO_CRL_CNF6_Pos                (26)
#define GPIO_CRL_CNF6                    (0x03U << GPIO_CRL_CNF6_Pos)   /*!< CNF6[1:0] bits (portx configuration bits, pin 6) */
#define GPIO_CRL_CNF6_0                  (0x01U << GPIO_CRL_CNF6_Pos)   /*!< Bit 0 */
#define GPIO_CRL_CNF6_1                  (0x02U << GPIO_CRL_CNF6_Pos)   /*!< Bit 1 */

#define GPIO_CRL_MODE7_Pos               (28)
#define GPIO_CRL_MODE7                   (0x03U << GPIO_CRL_MODE7_Pos)  /*!< MODE7[1:0] bits (portx mode bits, pin 7) */
#define GPIO_CRL_MODE7_0                 (0x01U << GPIO_CRL_MODE7_Pos)  /*!< Bit 0 */
#define GPIO_CRL_MODE7_1                 (0x02U << GPIO_CRL_MODE7_Pos)  /*!< Bit 1 */

